sp15-hw4/app/controllers/dogs_controller.rb

  def create
    @dog = Dog.create(dog_params)
---
INSERT INTO "dogs" ("age", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["age", 8], ["created_at", "2015-03-13 00:55:54.535134"], ["name", "Lucy"], ["updated_at", "2015-03-13 00:55:54.535134"]]

  def show
    @dog = Dog.find(params[:id]) # Query for the dog with the id that is in params
---
SELECT  "dogs".* FROM "dogs"  WHERE "dogs"."id" = ? LIMIT 1  [["id", 1]]