proj1/app/controllers/pokemons_controller.rb

SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = 3  [["trainer_id", 5], ["updated_at", "2015-04-01 23:14:02.717641"]]
---
	def capture
		@captured = Pokemon.find(params[:id])
		@captured.trainer_id = current_trainer.id
		@captured.save

SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = 3  [["health", 90], ["updated_at", "2015-04-02 03:34:11.898495"]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 3]]
---
	def damage
		@damaged = Pokemon.find(params[:id])
		@damaged.health -= 10
		@damaged.save
		if @damaged.health <= 0
			@damaged.destroy

INSERT INTO "pokemons" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-04-03 02:05:34.542896"], ["name", "Hello"], ["updated_at", "2015-04-03 02:05:34.542896"]]
UPDATE "pokemons" SET "health" = ?, "level" = ?, "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = 35  [["health", 100], ["level", 1], ["trainer_id", 5], ["updated_at", "2015-04-03 02:06:35.139557"]]
---
	 def create
    	@pokemon = Pokemon.create(pokemon_params)
    	@pokemon.health = 100
		@pokemon.level = 1
		@pokemon.trainer_id = current_trainer.id
		@pokemon.save