sp15-hw3/app/controllers/pages_controller.rb

SELECT "users".* FROM "users"
SELECT "cats".* FROM "cats"
SELECT "todos".* FROM "todos"
---
  def home
  	@data = User.all
  	@data2 = Cat.all
  	@data3 = Todo.all